Repository: JoseJunior-L4/rhex
Catalog: lib/l10n/app_*.arb
Languages: pt

# menuFile
source: File
pt: Arquivo

# menuOpen
source: Open
pt: Abrir

# menuSave
source: Save
pt: Salvar

# menuImportImage
source: Import Image
pt: Importar Imagem

# menuExportPng
source: Export PNG
pt: Exportar PNG

# menuEdit
source: Edit
pt: Editar

# menuUndo
source: Undo
pt: Desfazer

# menuRedo
source: Redo
pt: Refazer

# menuClearAll
source: Clear All
pt: Limpar Tudo

# menuHelp
source: Help
pt: Ajuda

# menuHelpShortcuts
source: Help & Shortcuts
pt: Ajuda e Atalhos

# sidebarGridSize
source: Grid Size
pt: Tamanho da Grade

# sidebarHexLabels
source: Hex Labels
pt: Rótulos Hex

# sidebarAddColor
source: Add Color
pt: Adicionar Cor

# sidebarHistory
source: History
pt: Histórico

# dialogClearTitle
source: Clear Palette?
pt: Limpar Paleta?

# dialogClearDescription
source: Are you sure you want to remove all colors? This action can be undone.
pt: Tem certeza de que deseja remover todas as cores? Esta ação pode ser desfeita.

# actionCancel
source: Cancel
pt: Cancelar

# actionClear
source: Clear All
pt: Limpar Tudo

# actionAdd
source: Add
pt: Adicionar

# actionUpdate
source: Update
pt: Atualizar

# toastPaletteCleared
source: Palette cleared
pt: Paleta limpa

# toastPaletteLoaded
source: Palette loaded successfully!
pt: Paleta carregada com sucesso!

# toastErrorLoading
source: Error loading palette: {error}
pt: Erro ao carregar paleta: {error}

# toastPaletteSaved
source: Palette saved successfully!
pt: Paleta salva com sucesso!

# toastErrorSaving
source: Error saving palette: {error}
pt: Erro ao salvar paleta: {error}

# toastImportedColors
source: Imported {count} colors successfully!
pt: Importadas {count} cores com sucesso!

# toastNoColorsExport
source: No colors to export!
pt: Sem cores para exportar!

# toastPaletteExported
source: Palette exported successfully!
pt: Paleta exportada com sucesso!

# toastErrorExporting
source: Error exporting palette: {error}
pt: Erro ao exportar paleta: {error}

# dialogEditColorTitle
source: Edit Color
pt: Editar Cor

# dialogShadeGeneratorTitle
source: Shade Generator
pt: Gerador de Sombras

# labelBaseColor
source: Base Color
pt: Cor Base

# labelTints
source: Tints
pt: Tons Claros

# labelShades
source: Shades
pt: Tons Escuros

# importWizardTitle
source: Import Image
pt: Importar Imagem

# labelSelectImage
source: Select Image
pt: Selecionar Imagem

# labelMaxColors
source: Max Colors
pt: Máx. Cores

# actionExtractColors
source: Extract Colors
pt: Extrair Cores

# actionImport
source: Import
pt: Importar

# helpShortcutFileOps
source: File Operations
pt: Operações de Arquivo

# helpShortcutEditView
source: Edit & View
pt: Editar e Visualizar

# helpShortcutColorEditing
source: Color Editing
pt: Edição de Cores

# helpShortcutAddNewColor
source: Add New Color
pt: Adicionar Nova Cor

# helpShortcutSavePalette
source: Save Palette (JSON)
pt: Salvar Paleta (JSON)

# helpShortcutOpenPalette
source: Open Palette (JSON)
pt: Abrir Paleta (JSON)

# helpShortcutExportPng
source: Export as PNG
pt: Exportar como PNG

# helpShortcutImportImage
source: Import Image
pt: Importar Imagem

# helpShortcutUndo
source: Undo
pt: Desfazer

# helpShortcutRedo
source: Redo
pt: Refazer

# helpShortcutRedoAlt
source: Redo (Alternative)
pt: Refazer (Alternativo)

# helpShortcutClearAll
source: Clear All Colors
pt: Limpar Todas as Cores

# helpShortcutShowHelp
source: Show Help
pt: Mostrar Ajuda

# helpShortcutGenerateShades
source: Generate Tints & Shades
pt: Gerar Tons

# helpTabShortcuts
source: Keyboard Shortcuts
pt: Atalhos de Teclado

# helpTabUsage
source: General Usage
pt: Uso Geral

# helpUsageTitle
source: Welcome to Rhex
pt: Bem-vindo ao Rhex

# helpUsageDescription
source: A minimal and keyboard-first color palette manager for developers and designers.
pt: Um gerenciador de paletas de cores mínimo e focado em teclado para desenvolvedores e designers.

# helpUsageItem1
source: Click the color circle to open the color picker
pt: Clique no círculo de cor para abrir o seletor

# helpUsageItem2
source: Type hex codes directly or select from history
pt: Digite códigos hex diretamente ou selecione do histórico

# helpUsageItem3
source: Adjust grid size to organize your palette
pt: Ajuste o tamanho da grade para organizar sua paleta

# helpUsageItem4
source: Right-click any color to generate tints and shades
pt: Clique com o botão direito em qualquer cor para gerar tons

# helpUsageItem5
source: Drag and drop to reorder colors
pt: Arraste e solte para reordenar cores

# labelColorInput
source: Color Input
pt: Entrada de Cor

# labelPickColor
source: Pick a color
pt: Escolha uma cor

# actionSelect
source: Select
pt: Selecionar

# actionProcess
source: Process
pt: Processar

# actionStopAll
source: Stop All
pt: Parar Tudo

# actionSkipContinue
source: Skip & Continue
pt: Pular e Continuar

# actionBatchAdd
source: Batch Add
pt: Adicionar em Lote

# dialogBatchAddTitle
source: Batch Add Colors
pt: Adicionar Cores em Lote

# dialogBatchAddDescription
source: Paste hex codes (one per line). Format: #RRGGBB or RRGGBB
pt: Cole códigos hex (um por linha). Formato: #RRGGBB ou RRGGBB

# dialogInvalidColorTitle
source: Invalid Color Found
pt: Cor Inválida Encontrada

# dialogInvalidColorDescription
source: Line {line}: "{content}" is not a valid hex code.
pt: Linha {line}: "{content}" não é um código hex válido.

# toastBatchProcessingStopped
source: Added {count} valid colors. Processing stopped.
pt: Adicionadas {count} cores válidas. Processamento parado.

# toastBatchSuccess
source: Successfully added {count} colors!
pt: Adicionadas {count} cores com sucesso!

# toastBatchNoColors
source: No valid colors found to add.
pt: Nenhuma cor válida encontrada para adicionar.

# labelNoHistory
source: No colors in history yet
pt: Nenhuma cor no histórico ainda

# actionClose
source: Close
pt: Fechar

# helpSectionAddingColors
source: Adding Colors
pt: Adicionando Cores

# helpSectionAddingColorsContent
source: • Type a hex code in the sidebar (e.g. #FF5500) and press Enter. • Click the color preview box to open a visual color picker. • Use the "Add Color" button to add the current color to your grid. • Click the Dice icon to generate a random color.
pt: • Digite um código hex na barra lateral (ex: #FF5500) e precione Enter. • Clique na caixa de pré-visualização de cor para abrir o seletor de cores. • Use o botão "Adicionar Cor" para adicionar a cor atual à sua grade. • Clique no ícone de Dado para gerar uma cor aleatória.

# helpSectionManagingGrid
source: Managing the Grid
pt: Gerenciando a Grade

# helpSectionManagingGridContent
source: • Click any color tile in the grid to Edit or Delete it. • Use the Grid Size slider to change how many columns are displayed. • Toggle "Show Hex Labels" to hide/show text overlays.
pt: • Clique em qualquer bloco de cor na grade para Editar ou Excluir. • Use o controle deslizante Tamanho da Grade para alterar quantas colunas são exibidas. • Alterne "Rótulos Hex" para ocultar/mostrar sobreposições de texto.

# helpSectionImportExport
source: Import & Export
pt: Importar e Exportar

# helpSectionImportExportContent
source: • Import Image: Extract a palette from any image file. • Save/Open: Save your work as a .json file to work on later. • Export PNG: Generate a high-quality image of your palette.
pt: • Importar Imagem: Extraia uma paleta de qualquer arquivo de imagem. • Salvar/Abrir: Salve seu trabalho como um arquivo .json para trabalhar mais tarde. • Exportar PNG: Gere uma imagem de alta qualidade da sua paleta.

# dialogShadeGeneratorDescription
source: Generate tints and shades for {hex}
pt: Gerar tons e sombras para {hex}

# labelTintsLighter
source: Tints (Lighter)
pt: Tons (Mais Claro)

# labelShadesDarker
source: Shades (Darker)
pt: Sombras (Mais Escuro)

# toastColorAdded
source: Color Added
pt: Cor Adicionada

# toastColorAddedMessage
source: {hex} added to palette
pt: {hex} adicionada à paleta

# toastErrorLoadingImage
source: Failed to load image: {error}
pt: Falha ao carregar imagem: {error}

# importWizardDescription
source: Adjust grid to capture colors
pt: Ajuste a grade para capturar cores

# actionImportColors
source: Import Colors
pt: Importar Cores

# labelGridSettings
source: Grid Settings
pt: Configurações da Grade

# labelRows
source: Rows
pt: Linhas

# labelColumns
source: Columns
pt: Colunas

# labelGridVisibility
source: Grid Visibility
pt: Visibilidade da Grade

# labelExtractedColors
source: Extracted Colors
pt: Cores Extraídas
